app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("name", "street", "landmark", "city", "state", "country", "pincode", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

UPDATE "addresses" SET "landmark" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["landmark", "Sudama Chawk, Mota Varachha"], ["updated_at", "2022-09-12 09:12:10.770323"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address.destroy