app/controllers/log_ins_controller.rb

  def index
    @log_ins = LogIn.all
---
SELECT "log_ins".* FROM "log_ins"

  def create
    @log_in = LogIn.new(log_in_params)

    respond_to do |format|
      if @log_in.save
---
INSERT INTO "log_ins" ("user", "city", "state", "order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user", "nishant "], ["city", "bhavnagar"], ["state", "gujrat"], ["order", 5], ["created_at", "2022-09-12 09:41:18.336739"], ["updated_at", "2022-09-12 09:41:18.336739"]]

  def update
    respond_to do |format|
      if @log_in.update(log_in_params)
---
UPDATE "log_ins" SET "order" = ?, "updated_at" = ? WHERE "log_ins"."id" = ?  [["order", 11], ["updated_at", "2022-09-12 09:52:47.069435"], ["id", 1]]

    def set_log_in
      @log_in = LogIn.find(params[:id])
---
SELECT "log_ins".* FROM "log_ins" WHERE "log_ins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]